# Pandas - Week 3

***

## Membagi data frame menjadi dua secara acak

### 1. Import Modules

In [1]:
import pandas as pd
import numpy as np

### 2. Persiapan Data Frame

In [3]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns = cols)

df

    A   B   C   D   E
0  19  15   9   1   3
1  14  14  18  18   1
2  18  16  19  17   6
3  16   8   2   7  10
4   8  12  17   3  15
5   6  19  17  11   5
6   4  19  18  11   2
7  13   6   1   9  14
8   9  12   9  12  15
9   3   4   9  13   9

### 3. Membagi Data Frame menjadi dua secara acak berdasarkan proporsi tertentu.

In [4]:
df.shape

(10, 5)

In [5]:
proporsi = 0.7 #Penentuan proposi: 70% untuk Data Frame 1, dan 30% untuk DF 2.
df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index) #Menghapus baris yang sudah diadopsi oleh df_1.

print(f'df_1 shape: {df_1.shape}')
print(f'df_2 shape: {df_2.shape}')

df_1 shape: (7, 5)
df_2 shape: (3, 5)

Fungsi `sample()` merupakan method yang akan mengambil baris secara acak berdasarkan proporsi yang sudah ditentukan dari baris-baris dataframe DF dan akan ditampung di DF_1.

In [6]:
df_1

    A   B   C   D   E
7  13   6   1   9  14
5   6  19  17  11   5
6   4  19  18  11   2
3  16   8   2   7  10
0  19  15   9   1   3
1  14  14  18  18   1
2  18  16  19  17   6

In [7]:
df_2

   A   B   C   D   E
4  8  12  17   3  15
8  9  12   9  12  15
9  3   4   9  13   9

***

## Mengganti nama kolom pada Data Frame berdasarkan pola

### 1. Import modules

In [2]:
import pandas as pd

### 2. Persiapan Data Frame

In [15]:
df2 = pd.read_csv('./data/titanicfull.csv')
df2.columns = ('Pclass', 'Survival status', 'full Name', 'Sex ', ' Age', 'Sib SP', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked')

df2_backup = df2.copy(deep=True)

df2.head()

,Pclass,Survival status,full Name,Sex,Age,Sib SP,Parch,Ticket,Fare,Cabin,Embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

### 3. Menggunakan lowercase untuk nama kolom dan mengganti spasi dengan `_`

In [19]:
df2.columns = df2.columns.str.replace(' ', '_').str.lower()
df2.head()

,pclass,survival_status,full_name,sex_,_age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

Method `str.replace()` akan mengganti karakter yang dituju menjadi karakter yang diinginkan. Dalam kasus ini, karakter spasi akan diganti dengan underscore. Sedangkan method `str.lower()` akan mengganti nama kolom menjadi lowercase.

### 4. Menghilangkan kelebihan spasi pada nama kolom.

In [20]:
df2 = df2_backup.copy(deep=True)
df2.columns = df2.columns.str.lower().str.strip().str.replace(' ', '_')

df2.head()

,pclass,survival_status,full_name,sex,age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

Method `str.strip()` akan memotong kelebihan spasi di sisi kanan dan sisi kiri.

***

## Seleksi kolom dan baris pada Data Frame menggunakan `loc`

### 1. Import modules

In [21]:
import pandas as pd
import numpy as np

### 2. Persiapan Data Frame

In [22]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns = cols)

df

    A   B   C   D   E
0  11  10   1  12  11
1   1  19   8   8  15
2  12   7   6  14  15
3  16  18   4  17  10
4  10  11  18   1   7
5   8   4   7   3  11
6  10  19  15  17   4
7  12  15  16  13  10
8  12  16   6   2  15
9  10  16   3   7   2

### 3. Seleksi kolom dan baris menggunakan `loc`

In [23]:
df.loc[[0, 3, 4], ['B', 'E']]

    B   E
0  10  11
3  18  10
4  11   7

`loc` terbagi menjadi dua bagian besar dimana setiap bagiannya dipisahkan dengan tanda koma. Bagian pertama digunakan untuk mengatur baris, dan bagian kedua digunakan untuk mengatur kolom.

### 4. Seleksi baris dengan kondisi

In [24]:
df.loc[df['B']>10, ['B', 'D', 'E']]

    B   D   E
1  19   8  15
3  18  17  10
4  11   1   7
6  19  17   4
7  15  13  10
8  16   2  15
9  16   7   2

Pada kasus ini, baris yang ditampilkan adalah baris yang memiliki nilai di atas 10 di kolom B.

### 5. Slicing Data Frame dengan `loc`

In [25]:
df.loc[0:4, 'B':'D'] #Slicing dari baris ke 0 sampai ke 4, dan mulai dari kolom B ke D.

    B   C   D
0  10   1  12
1  19   8   8
2   7   6  14
3  18   4  17
4  11  18   1